УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыФормированияСегментов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФормироватьВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПеренесеноСДоработками

&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("БизнесРегион"); // До момента полного переноса данных не включать
	
	//++#1615 смарт: Лопато 23.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
	ПроверяемыеРеквизиты.Добавить("ОсновнойМенеджер");
	//ПроверяемыеРеквизиты.Добавить("смартМенеджерПоРасходнымМатериалам");
	//--#1615 смарт: Лопато 23.01.2024
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ)
	
	//++ Смарт:  Демичев №877 02.02.2022
	Если Не ЭтоНовый() И Не ЭтоГруппа Тогда
		
		мРолиДоступны = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеПризнакаДилерСЦ,смартИзменениеПризнакаДилер");
		
		Если не мРолиДоступны Тогда
			
			Если ЭтотОбъект.смартДилерБывший <> ЭтотОбъект.Ссылка.смартДилерБывший Тогда
				
				Отказ = Истина;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- Смарт:  Демичев №877 02.02.2022
	
	//++#1307 смарт: Лопато 21.02.2023 //Запретить контактных лиц на "неопределенном партнере"
	Если НЕ ЭтоНовый() И ЭтотОбъект.Предопределенный = Истина Тогда
		
		РеквизитыПроверкиПредопределенного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "Наименование, НаименованиеПолное");		
		
		Если РеквизитыПроверкиПредопределенного.Наименование <> ЭтотОбъект.Наименование 
			ИЛИ РеквизитыПроверкиПредопределенного.НаименованиеПолное <> ЭтотОбъект.НаименованиеПолное Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Запрещено изменять наименование предопределенных партнеров!'"), , , , Отказ);

		КонецЕсли;	
	КонецЕсли;	
	//--#1307 смарт: Лопато 21.02.2023
	
	//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.смартМенеджерПоРасходнымМатериалам) И ЗначениеЗаполнено(ЭтотОбъект.ОсновнойМенеджер) Тогда
		ЭтотОбъект.смартМенеджерПоРасходнымМатериалам = ЭтотОбъект.ОсновнойМенеджер;
	КонецЕсли;	
	//--#1615 смарт: Лопато 08.02.2024

	//++#1936 смарт: Лопато 29.07.2024 //Управление запретом изменять основного менеджера клиента  
	Если НЕ ЭтоНовый() 
		И НЕ Пользователи.РолиДоступны("ПолныеПрава,
									   |смартДоступРедактироватьЗаблокированогоМенеджераКлиента",
									   Пользователи.АвторизованныйПользователь()) Тогда

		ПрошлыйОсновнойМенеджер = ЭтотОбъект.Ссылка.ОсновнойМенеджер;
									   
		Если ЗначениеЗаполнено(ПрошлыйОсновнойМенеджер)
			И ЭтотОбъект.ОсновнойМенеджер <> ПрошлыйОсновнойМенеджер Тогда
									   
			//++ #2051 смарт: Фролов 11.09.2024 //Делаем механизм изменения основного менеджера по звонку для всех партнеров,а не только для Джавадовой (продолжение 1936)
			//МассивМенеджеров = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(
			//					   "ОсновныеМенеджерыДляОграниченияДоступаРедактированияПартнеров", Истина);

			//Если МассивМенеджеров.Количество() > 0
			//	И МассивМенеджеров.Найти(ПрошлыйОсновнойМенеджер) <> Неопределено Тогда
			//-- #2051 смарт: Фролов 11.09.2024
				
				Если НЕ смартОбщегоНазначения.смартБылЗвонокОтветственногоПартнеру(Пользователи.АвторизованныйПользователь(),
																				   ЭтотОбъект.Ссылка,
																				   Дата(2024, 7, 22),
					//++ #Б-1572 смарт: Фролов 05.12.2024 //Вернуть длительность звонка - 30 сек. необходимую для смены ответственного.
																				   //3600 * 24 * 2, //48 часов
																					//60)
																					   3600 * 24 * 30,
					//++ #Б-6000 смарт: Фролов 10.03.2026 //Вынести в предопределенные настройки параметр длительности звонка.																   
																					//30)
																					   Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера)
					//-- #Б-6000 смарт: Фролов 10.03.2026																   
																				   Тогда

					Отказ = Истина;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						//++ #Б-6018 смарт: Фролов 11.03.2026 //Исправить оповещение о нужной длительности звонка.
						//НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более 30 сек.'"));
						НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более "
						+ Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера + "сек.'")); 
						//-- #Б-6018 смарт: Фролов 11.03.2026
					//-- #Б-1572 смарт: Фролов 05.12.2024												
					
				КонецЕсли;	
				
			//++ #2051 смарт: Фролов 11.09.2024 //Делаем механизм изменения основного менеджера по звонку для всех партнеров,а не только для Джавадовой (продолжение 1936)
			//КонецЕсли;
			//-- #2051 смарт: Фролов 11.09.2024
				
		КонецЕсли;	
			
	КонецЕсли;
	//--#1936 смарт: Лопато 29.07.2024
	
	//++ #Б-5040 смарт: Фролов 24.11.2025 //Сделать возможным изменение ответственного по РМ, при соблюдении условий
	Если НЕ ЭтоНовый() 
		И НЕ Пользователи.РолиДоступны("ПолныеПрава,
									   |смартДоступРедактироватьЗаблокированогоМенеджераКлиента",
									   Пользователи.АвторизованныйПользователь()) Тогда

		ПрошлыйМенеджерРМ = ЭтотОбъект.Ссылка.смартМенеджерПоРасходнымМатериалам;
									   
		Если ЗначениеЗаполнено(ПрошлыйМенеджерРМ)
			И ЭтотОбъект.смартМенеджерПоРасходнымМатериалам <> ПрошлыйМенеджерРМ Тогда
					
				Если НЕ смартОбщегоНазначения.смартБылЗвонокОтветственногоПартнеру(Пользователи.АвторизованныйПользователь(),
																				   ЭтотОбъект.Ссылка,
																				   Дата(2024, 7, 22),
																					   3600 * 24 * 30,
					//++ #Б-6000 смарт: Фролов 10.03.2026 //Вынести в предопределенные настройки параметр длительности звонка.																   
																					//30)
																					   Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера)
					//-- #Б-6000 смарт: Фролов 10.03.2026																   
																				   Тогда

					Отказ = Истина;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						//++ #Б-6018 смарт: Фролов 11.03.2026 //Исправить оповещение о нужной длительности звонка.
						//НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более 30 сек.'"));
						НСтр("ru='Не соблюдены условия для смены ответственного: наличие звонка партнеру за последние 30 дней и длительностью более "
						+ Справочники.смартПредопределенныеЗначения.Настройки.ДлительностьЗвонкаДляПереводаПартнера + "сек.'")); 
						//-- #Б-6018 смарт: Фролов 11.03.2026
					
				КонецЕсли;	
				
		КонецЕсли;	
			
	КонецЕсли;
	//-- #Б-5040 смарт: Фролов 24.11.2025
	
	//++ #Б-2796 смарт: Фролов 26.03.2025 //Закрытие просроченных задач и взаимодействий в случае если изменен ответственный в партнере.
	ДополнительныеСвойства.Вставить("ПредыдущийОтветственный", Ссылка.ОсновнойМенеджер);
	ДополнительныеСвойства.Вставить("ПредыдущийОтветственныйСЦ", Ссылка.смартОсновнойМенеджерСервисЦентра);
	ДополнительныеСвойства.Вставить("ПредыдущийОтветственныйРМ", Ссылка.смартМенеджерПоРасходнымМатериалам);
	//-- #Б-2796 смарт: Фролов 26.03.2025
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	Если Ссылка.смартНеКонтролироватьТехническуюОтсрочку <> ЭтотОбъект.смартНеКонтролироватьТехническуюОтсрочку Тогда
		ЭтотОбъект.смартИДНеКонтролироватьТехническуюОтсрочку = Новый УникальныйИдентификатор;
	КонецЕсли;
	//-- #4792 смарт: Тимофеева 17.03.26
КонецПроцедуры

&После("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)

	//++#1283 смарт: Лопато 01.02.2023 //Автоматическое заполнение у партнера признака «Ключевые клиенты по расходным материалам»  
	смартКлючевойКлиентПоРасходнымМатериалам = Ложь;
	смартСрокПроверкиКлючевойКлиент = Неопределено;
	//--#1283 смарт: Лопато 01.02.2023

	//++ #Б-1138 смарт: Лопато 15.10.2024 //ИМ. Выгрузка заказов на сайт. Ограничение по дате  
	смартДатаНачалаОбменаДокументамиИМ = Неопределено;
	//-- #Б-1138 смарт: Лопато 15.10.2024
	
КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
//++ #Б-2418 смарт: Фролов 19.02.2025 //Ошибка во взаимодейтсвиях при создании нового партнера
Процедура смарт_ПриЗаписи(Отказ)

	ОбщегоНазначенияУТ.СинхронизироватьКлючи(ЭтотОбъект);

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПартнерыИКонтрагенты.ЗаписатьИерархиюПартнера(Ссылка);

	#Вставка
	//++ #Б-2418 смарт: Фролов 19.02.2025 //Ошибка во взаимодейтсвиях при создании нового партнера
	НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		СтрНаборЗаписей = НаборЗаписей.Добавить();
		СтрНаборЗаписей.Партнер = Ссылка;
		СтрНаборЗаписей.Состояние = Перечисления.смартСостоянияПартнеров.Свободен;
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	//-- #Б-2418 смарт: Фролов 19.02.2025
	
	//++ #Б-2796 смарт: Фролов 26.03.2025 //Закрытие просроченных задач и взаимодействий в случае если изменен ответственный в партнере.
	Если ДополнительныеСвойства.ПредыдущийОтветственный <> ОсновнойМенеджер 
		И смартОсновнойМенеджерСервисЦентра <> ДополнительныеСвойства.ПредыдущийОтветственный
		И смартМенеджерПоРасходнымМатериалам <> ДополнительныеСвойства.ПредыдущийОтветственный Тогда
		
		смартЗавершитьЗадачиИВзаимодействия(ДополнительныеСвойства.ПредыдущийОтветственный);	
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПредыдущийОтветственныйСЦ <> смартОсновнойМенеджерСервисЦентра 
		И ОсновнойМенеджер <> ДополнительныеСвойства.ПредыдущийОтветственныйСЦ
		И смартМенеджерПоРасходнымМатериалам <> ДополнительныеСвойства.ПредыдущийОтветственныйСЦ Тогда
		
		смартЗавершитьЗадачиИВзаимодействия(ДополнительныеСвойства.ПредыдущийОтветственныйСЦ);	
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПредыдущийОтветственныйРМ <> смартМенеджерПоРасходнымМатериалам 
		И смартОсновнойМенеджерСервисЦентра <> ДополнительныеСвойства.ПредыдущийОтветственныйРМ
		И ОсновнойМенеджер <> ДополнительныеСвойства.ПредыдущийОтветственныйРМ Тогда
		
		смартЗавершитьЗадачиИВзаимодействия(ДополнительныеСвойства.ПредыдущийОтветственныйРМ);	
		
	КонецЕсли;
	//-- #Б-2796 смарт: Фролов 26.03.2025
	
	//++ #4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1 
	Если ЗначениеЗаполнено(ЭтотОбъект.смартИДНеКонтролироватьТехническуюОтсрочку) И НЕ Отказ Тогда
		
		ДанныеОРазрешении = РегистрыСведений.смартИсторияИзмененияРазрешений.ПолучитьИнформациюПоРазрешению(Ссылка, ЭтотОбъект.смартИДНеКонтролироватьТехническуюОтсрочку, "НеКонтролироватьТехническуюОтсрочку");
		Если ДанныеОРазрешении = Неопределено Тогда
			
			РегистрыСведений.смартИсторияИзмененияРазрешений.ЗаписатьРазрешениеВИсторию(Ссылка,, 
																						"НеКонтролироватьТехническуюОтсрочку", 
																						ЭтотОбъект.смартНеКонтролироватьТехническуюОтсрочку, 
																						ЭтотОбъект.смартИДНеКонтролироватьТехническуюОтсрочку);
																						
			СегментИсключенийДляТехническойОтсрочки = Справочники.смартПредопределенныеЗначения.СегментИсключенийДляТехническойОтсрочки.Значение;																			
			Если ЗначениеЗаполнено(СегментИсключенийДляТехническойОтсрочки) 
				И ТипЗнч(СегментИсключенийДляТехническойОтсрочки) = Тип("СправочникСсылка.СегментыПартнеров")
				И СегментИсключенийДляТехническойОтсрочки.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
				
				Если ЭтотОбъект.смартНеКонтролироватьТехническуюОтсрочку Тогда
					СегментыСервер.ДобавитьПартнераВСегмент(СегментИсключенийДляТехническойОтсрочки, Ссылка); 
				Иначе
					СегментыСервер.УдалитьПартнераИзСегмента(СегментИсключенийДляТехническойОтсрочки, Ссылка); 
				КонецЕсли;	
			КонецЕсли;																				
		КонецЕсли;
		
	КонецЕсли;
	//-- #4792 смарт: Тимофеева 17.03.26
	#КонецВставки
	
КонецПроцедуры //-- #Б-2418 смарт: Фролов 19.02.2025

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б-2796 смарт: Фролов 26.03.2025 //Закрытие просроченных задач и взаимодействий в случае если изменен ответственный в партнере.
Процедура смартЗавершитьЗадачиИВзаимодействия(Менеджер)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя
	|ГДЕ
	|	НЕ Выполнена
	|	И НЕ ПометкаУдаления
	|	И СрокИсполнения < &ТекущаяДата
	|	И Предмет = &Партнер
	|	И Исполнитель = &Менеджер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Ответственный = &Менеджер
	|	И Партнер = &Партнер
	|	И НЕ (СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|			ИЛИ СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено))
	|	И ПлановаяДата < &ТекущаяДата");
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Партнер", Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			
			ОбъектОбработки = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектОбработки.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено;
			ОбъектОбработки.ДатаЗавершенияВзаимодействия = ТекущаяДата();
			ОбъектОбработки.Результат = "Взаимодействие завершено автоматически";
			ОбъектОбработки.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначения.СообщитьПользователю("Взаимодействие " + Выборка.Ссылка + " отменено.", Выборка.Ссылка);
			
		Иначе
			
			ОбъектОбработки = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектОбработки.Выполнена = Истина;
			ОбъектОбработки.ДатаИсполнения = ТекущаяДата(); 
			ОбъектОбработки.РезультатВыполнения = "Задача завершена автоматически";
			ОбъектОбработки.Записать();
			ОбщегоНазначения.СообщитьПользователю("Задача " + Выборка.Ссылка + " завершена.", Выборка.Ссылка);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры //-- #Б-2796 смарт: Фролов 26.03.2025

#КонецОбласти

#КонецЕсли
